spec/support/cassettes/StripeWrapper/StripeWrapper_Customer/_create/does_not_create_a_customer_with_declined_card.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: US-ASCII
      string: card=tok_chargeDeclined&email=carey%40bernierorn.biz&plan=base
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/4.18.0
      Authorization:
      - Bearer sk_test_yHSLZKDkZM4GVBqKjRatRMFq007havnh8t
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"4.18.0","lang":"ruby","lang_version":"2.1.2 p95 (2014-05-08)","platform":"x86_64-linux","engine":"ruby","publisher":"stripe","uname":"Linux
        version 4.15.0-20-generic (buildd@lgw01-amd64-039) (gcc version 7.3.0 (Ubuntu
        7.3.0-16ubuntu3)) #21-Ubuntu SMP Tue Apr 24 06:16:15 UTC 2018","hostname":"nigel-X540SA"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      Connection:
      - keep-alive
      Keep-Alive:
      - 30
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 03 Jun 2019 10:44:35 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '4987'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_wqsd5zeREi7LCg
      Stripe-Version:
      - '2019-05-16'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "cus_FBaqyOS2G8G85q",
          "object": "customer",
          "account_balance": 0,
          "address": null,
          "balance": 0,
          "created": 1559558673,
          "currency": "usd",
          "default_source": "card_1EhDeXDbHuZc0afKEABapnx1",
          "delinquent": false,
          "description": null,
          "discount": null,
          "email": "carey@bernierorn.biz",
          "invoice_prefix": "0B9DB4D0",
          "invoice_settings": {
            "custom_fields": null,
            "default_payment_method": null,
            "footer": null
          },
          "livemode": false,
          "metadata": {
          },
          "name": null,
          "phone": null,
          "preferred_locales": [

          ],
          "shipping": null,
          "sources": {
            "object": "list",
            "data": [
              {
                "id": "card_1EhDeXDbHuZc0afKEABapnx1",
                "object": "card",
                "address_city": null,
                "address_country": null,
                "address_line1": null,
                "address_line1_check": null,
                "address_line2": null,
                "address_state": null,
                "address_zip": null,
                "address_zip_check": null,
                "brand": "Visa",
                "country": "US",
                "customer": "cus_FBaqyOS2G8G85q",
                "cvc_check": null,
                "dynamic_last4": null,
                "exp_month": 6,
                "exp_year": 2020,
                "fingerprint": "l4yeecpIhReNNAlw",
                "funding": "credit",
                "last4": "0002",
                "metadata": {
                },
                "name": null,
                "tokenization_method": null
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_FBaqyOS2G8G85q/sources"
          },
          "subscriptions": {
            "object": "list",
            "data": [
              {
                "id": "sub_FBaqkW0kjKEq84",
                "object": "subscription",
                "application_fee_percent": null,
                "billing": "charge_automatically",
                "billing_cycle_anchor": 1559558673,
                "billing_thresholds": null,
                "cancel_at": null,
                "cancel_at_period_end": false,
                "canceled_at": null,
                "collection_method": "charge_automatically",
                "created": 1559558673,
                "current_period_end": 1562150673,
                "current_period_start": 1559558673,
                "customer": "cus_FBaqyOS2G8G85q",
                "days_until_due": null,
                "default_payment_method": null,
                "default_source": null,
                "default_tax_rates": [

                ],
                "discount": null,
                "ended_at": null,
                "items": {
                  "object": "list",
                  "data": [
                    {
                      "id": "si_FBaquCeC7w4ATb",
                      "object": "subscription_item",
                      "billing_thresholds": null,
                      "created": 1559558674,
                      "metadata": {
                      },
                      "plan": {
                        "id": "base",
                        "object": "plan",
                        "active": true,
                        "aggregate_usage": null,
                        "amount": 999,
                        "billing_scheme": "per_unit",
                        "created": 1559558277,
                        "currency": "usd",
                        "interval": "month",
                        "interval_count": 1,
                        "livemode": false,
                        "metadata": {
                        },
                        "nickname": "monthly",
                        "product": "prod_FBajfwNdszmEP5",
                        "tiers": null,
                        "tiers_mode": null,
                        "transform_usage": null,
                        "trial_period_days": null,
                        "usage_type": "licensed"
                      },
                      "quantity": 1,
                      "subscription": "sub_FBaqkW0kjKEq84",
                      "tax_rates": [

                      ]
                    }
                  ],
                  "has_more": false,
                  "total_count": 1,
                  "url": "/v1/subscription_items?subscription=sub_FBaqkW0kjKEq84"
                },
                "latest_invoice": "in_1EhDeXDbHuZc0afKLF9ANlZ7",
                "livemode": false,
                "metadata": {
                },
                "plan": {
                  "id": "base",
                  "object": "plan",
                  "active": true,
                  "aggregate_usage": null,
                  "amount": 999,
                  "billing_scheme": "per_unit",
                  "created": 1559558277,
                  "currency": "usd",
                  "interval": "month",
                  "interval_count": 1,
                  "livemode": false,
                  "metadata": {
                  },
                  "nickname": "monthly",
                  "product": "prod_FBajfwNdszmEP5",
                  "tiers": null,
                  "tiers_mode": null,
                  "transform_usage": null,
                  "trial_period_days": null,
                  "usage_type": "licensed"
                },
                "quantity": 1,
                "schedule": null,
                "start": 1559558673,
                "start_date": 1559558673,
                "status": "incomplete",
                "tax_percent": null,
                "trial_end": null,
                "trial_start": null
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_FBaqyOS2G8G85q/subscriptions"
          },
          "tax_exempt": "none",
          "tax_ids": {
            "object": "list",
            "data": [

            ],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_FBaqyOS2G8G85q/tax_ids"
          },
          "tax_info": null,
          "tax_info_verification": null
        }
    http_version: 
  recorded_at: Mon, 03 Jun 2019 10:44:35 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/charges?customer=cus_FBaqyOS2G8G85q
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/4.18.0
      Authorization:
      - Bearer sk_test_yHSLZKDkZM4GVBqKjRatRMFq007havnh8t
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"4.18.0","lang":"ruby","lang_version":"2.1.2 p95 (2014-05-08)","platform":"x86_64-linux","engine":"ruby","publisher":"stripe","uname":"Linux
        version 4.15.0-20-generic (buildd@lgw01-amd64-039) (gcc version 7.3.0 (Ubuntu
        7.3.0-16ubuntu3)) #21-Ubuntu SMP Tue Apr 24 06:16:15 UTC 2018","hostname":"nigel-X540SA"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      Connection:
      - keep-alive
      Keep-Alive:
      - 30
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 03 Jun 2019 10:44:36 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '3490'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_1Fm1WdwwDrTbbm
      Stripe-Version:
      - '2019-05-16'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "object": "list",
          "data": [
            {
              "id": "ch_1EhDeYDbHuZc0afKC5o5e9hI",
              "object": "charge",
              "amount": 999,
              "amount_refunded": 0,
              "application": null,
              "application_fee": null,
              "application_fee_amount": null,
              "balance_transaction": null,
              "billing_details": {
                "address": {
                  "city": null,
                  "country": null,
                  "line1": null,
                  "line2": null,
                  "postal_code": null,
                  "state": null
                },
                "email": null,
                "name": null,
                "phone": null
              },
              "captured": false,
              "created": 1559558674,
              "currency": "usd",
              "customer": "cus_FBaqyOS2G8G85q",
              "description": "Payment for invoice D30724D-0001",
              "destination": null,
              "dispute": null,
              "failure_code": "card_declined",
              "failure_message": "Your card was declined.",
              "fraud_details": {
              },
              "invoice": "in_1EhDeXDbHuZc0afKLF9ANlZ7",
              "livemode": false,
              "metadata": {
              },
              "on_behalf_of": null,
              "order": null,
              "outcome": {
                "network_status": "declined_by_network",
                "reason": "generic_decline",
                "risk_level": "normal",
                "risk_score": 11,
                "seller_message": "The bank did not return any further details with this decline.",
                "type": "issuer_declined"
              },
              "paid": false,
              "payment_intent": "pi_1EhDeYDbHuZc0afKkOnQfvbU",
              "payment_method": "card_1EhDeXDbHuZc0afKEABapnx1",
              "payment_method_details": {
                "card": {
                  "brand": "visa",
                  "checks": {
                    "address_line1_check": null,
                    "address_postal_code_check": null,
                    "cvc_check": null
                  },
                  "country": "US",
                  "description": null,
                  "exp_month": 6,
                  "exp_year": 2020,
                  "fingerprint": "l4yeecpIhReNNAlw",
                  "funding": "credit",
                  "last4": "0002",
                  "three_d_secure": null,
                  "wallet": null
                },
                "type": "card"
              },
              "receipt_email": null,
              "receipt_number": null,
              "receipt_url": "https://pay.stripe.com/receipts/acct_1Egqh1DbHuZc0afK/ch_1EhDeYDbHuZc0afKC5o5e9hI/rcpt_FBaqMT3ze6re5BcrNLeJuMdWGmXnYdY",
              "refunded": false,
              "refunds": {
                "object": "list",
                "data": [

                ],
                "has_more": false,
                "total_count": 0,
                "url": "/v1/charges/ch_1EhDeYDbHuZc0afKC5o5e9hI/refunds"
              },
              "review": null,
              "shipping": null,
              "source": {
                "id": "card_1EhDeXDbHuZc0afKEABapnx1",
                "object": "card",
                "address_city": null,
                "address_country": null,
                "address_line1": null,
                "address_line1_check": null,
                "address_line2": null,
                "address_state": null,
                "address_zip": null,
                "address_zip_check": null,
                "brand": "Visa",
                "country": "US",
                "customer": "cus_FBaqyOS2G8G85q",
                "cvc_check": null,
                "dynamic_last4": null,
                "exp_month": 6,
                "exp_year": 2020,
                "fingerprint": "l4yeecpIhReNNAlw",
                "funding": "credit",
                "last4": "0002",
                "metadata": {
                },
                "name": null,
                "tokenization_method": null
              },
              "source_transfer": null,
              "statement_descriptor": null,
              "status": "failed",
              "transfer_data": null,
              "transfer_group": null
            }
          ],
          "has_more": false,
          "url": "/v1/charges"
        }
    http_version: 
  recorded_at: Mon, 03 Jun 2019 10:44:36 GMT
- request:
    method: delete
    uri: https://api.stripe.com/v1/customers/cus_FBaqyOS2G8G85q
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/4.18.0
      Authorization:
      - Bearer sk_test_yHSLZKDkZM4GVBqKjRatRMFq007havnh8t
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"4.18.0","lang":"ruby","lang_version":"2.1.2 p95 (2014-05-08)","platform":"x86_64-linux","engine":"ruby","publisher":"stripe","uname":"Linux
        version 4.15.0-20-generic (buildd@lgw01-amd64-039) (gcc version 7.3.0 (Ubuntu
        7.3.0-16ubuntu3)) #21-Ubuntu SMP Tue Apr 24 06:16:15 UTC 2018","hostname":"nigel-X540SA"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      Connection:
      - keep-alive
      Keep-Alive:
      - 30
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 03 Jun 2019 10:44:37 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '76'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_lMYGlgtD0i9yiv
      Stripe-Version:
      - '2019-05-16'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "cus_FBaqyOS2G8G85q",
          "object": "customer",
          "deleted": true
        }
    http_version: 
  recorded_at: Mon, 03 Jun 2019 10:44:37 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/charges?customer=cus_FBaqyOS2G8G85q
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/4.18.0
      Authorization:
      - Bearer sk_test_yHSLZKDkZM4GVBqKjRatRMFq007havnh8t
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"4.18.0","lang":"ruby","lang_version":"2.1.2 p95 (2014-05-08)","platform":"x86_64-linux","engine":"ruby","publisher":"stripe","uname":"Linux
        version 4.15.0-20-generic (buildd@lgw01-amd64-039) (gcc version 7.3.0 (Ubuntu
        7.3.0-16ubuntu3)) #21-Ubuntu SMP Tue Apr 24 06:16:15 UTC 2018","hostname":"nigel-X540SA"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      Connection:
      - keep-alive
      Keep-Alive:
      - 30
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 03 Jun 2019 10:44:38 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '3490'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_nqR7V24XwLOsTM
      Stripe-Version:
      - '2019-05-16'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "object": "list",
          "data": [
            {
              "id": "ch_1EhDeYDbHuZc0afKC5o5e9hI",
              "object": "charge",
              "amount": 999,
              "amount_refunded": 0,
              "application": null,
              "application_fee": null,
              "application_fee_amount": null,
              "balance_transaction": null,
              "billing_details": {
                "address": {
                  "city": null,
                  "country": null,
                  "line1": null,
                  "line2": null,
                  "postal_code": null,
                  "state": null
                },
                "email": null,
                "name": null,
                "phone": null
              },
              "captured": false,
              "created": 1559558674,
              "currency": "usd",
              "customer": "cus_FBaqyOS2G8G85q",
              "description": "Payment for invoice D30724D-0001",
              "destination": null,
              "dispute": null,
              "failure_code": "card_declined",
              "failure_message": "Your card was declined.",
              "fraud_details": {
              },
              "invoice": "in_1EhDeXDbHuZc0afKLF9ANlZ7",
              "livemode": false,
              "metadata": {
              },
              "on_behalf_of": null,
              "order": null,
              "outcome": {
                "network_status": "declined_by_network",
                "reason": "generic_decline",
                "risk_level": "normal",
                "risk_score": 11,
                "seller_message": "The bank did not return any further details with this decline.",
                "type": "issuer_declined"
              },
              "paid": false,
              "payment_intent": "pi_1EhDeYDbHuZc0afKkOnQfvbU",
              "payment_method": "card_1EhDeXDbHuZc0afKEABapnx1",
              "payment_method_details": {
                "card": {
                  "brand": "visa",
                  "checks": {
                    "address_line1_check": null,
                    "address_postal_code_check": null,
                    "cvc_check": null
                  },
                  "country": "US",
                  "description": null,
                  "exp_month": 6,
                  "exp_year": 2020,
                  "fingerprint": "l4yeecpIhReNNAlw",
                  "funding": "credit",
                  "last4": "0002",
                  "three_d_secure": null,
                  "wallet": null
                },
                "type": "card"
              },
              "receipt_email": null,
              "receipt_number": null,
              "receipt_url": "https://pay.stripe.com/receipts/acct_1Egqh1DbHuZc0afK/ch_1EhDeYDbHuZc0afKC5o5e9hI/rcpt_FBaqMT3ze6re5BcrNLeJuMdWGmXnYdY",
              "refunded": false,
              "refunds": {
                "object": "list",
                "data": [

                ],
                "has_more": false,
                "total_count": 0,
                "url": "/v1/charges/ch_1EhDeYDbHuZc0afKC5o5e9hI/refunds"
              },
              "review": null,
              "shipping": null,
              "source": {
                "id": "card_1EhDeXDbHuZc0afKEABapnx1",
                "object": "card",
                "address_city": null,
                "address_country": null,
                "address_line1": null,
                "address_line1_check": null,
                "address_line2": null,
                "address_state": null,
                "address_zip": null,
                "address_zip_check": null,
                "brand": "Visa",
                "country": "US",
                "customer": "cus_FBaqyOS2G8G85q",
                "cvc_check": null,
                "dynamic_last4": null,
                "exp_month": 6,
                "exp_year": 2020,
                "fingerprint": "l4yeecpIhReNNAlw",
                "funding": "credit",
                "last4": "0002",
                "metadata": {
                },
                "name": null,
                "tokenization_method": null
              },
              "source_transfer": null,
              "statement_descriptor": null,
              "status": "failed",
              "transfer_data": null,
              "transfer_group": null
            }
          ],
          "has_more": false,
          "url": "/v1/charges"
        }
    http_version: 
  recorded_at: Mon, 03 Jun 2019 10:44:38 GMT
recorded_with: VCR 4.0.0
